src/Reports/ОбщийОтчетЗаСутки/ОбщийОтчетЗаСутки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОбщийОтчетЗаСутки</name>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ОтправкаНаПочту/ОтправкаНаПочту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправкаНаПочту</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>ТипОтправляемогоДокумента</name>
    <type>
      <types>EnumRef.ТипОтправляемогоДокумента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОбщийОтчетЗаСутки/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//получаем идентификатор настройки
	ИдНастройки =
	КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту
	(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра
	(Новый ПараметрКомпоновкиДанных("Дата")));
	
	//получаем параметр по идентификатору
	ПараметрСКДДата =
	КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройки).Значение.Дата;
	
	// записываем текущего пользователя в значение параметра
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТекущийПользователь");
	ПараметрСКД.Значение = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ПараметрСКД.Использование = ИСТИНА; 
	
	
	//в случае если параметр отчета (дата) отличается от предыдущей настройки - проверяем состояние отправки
	Если ПараметрСКДДата <> ДатаДокумента Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправкаНаПочту.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОтправкаНаПочту КАК ОтправкаНаПочту
		|ГДЕ
		|	ОтправкаНаПочту.Период = &Период
		|	И ОтправкаНаПочту.ТипОтправляемогоДокумента = &ТипОтправляемогоДокумента";
	
		Запрос.УстановитьПараметр("Период", ПараметрСКДДата);
		Запрос.УстановитьПараметр("ТипОтправляемогоДокумента", Перечисления.ТипОтправляемогоДокумента.ОбщийОтчетЗаСутки);
		
		Если Запрос.Выполнить().Пустой() Тогда
			Отправлено = "Отчет еще не отправлялся";
		Иначе 
			Отправлено = "Отчет отправлен ранее";			
		КонецЕсли;
		
		ДатаДокумента = ПараметрСКДДата;
		
	КонецЕсли;
	                         	
	// настройки масштаба и ориентации 
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
КонецПроцедуры
